; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c5-s1-p1-a7)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 a5 a6 - airplane
          c0 c1 c2 c3 c4 - city
          t0 t1 t2 t3 t4 - truck
          l0-0 l1-0 l2-0 l3-0 l4-0 - airport
          p0 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (in-city  l2-0 c2)
    (in-city  l3-0 c3)
    (in-city  l4-0 c4)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l4-0)
    (at p0 l2-0)
    (at a0 l4-0)
    (at a1 l2-0)
    (at a2 l3-0)
    (at a3 l0-0)
    (at a4 l2-0)
    (at a5 l1-0)
    (at a6 l1-0)
)

(:goal
    (and
        (at p0 l4-0)
    )
)
)

; plan
1. (fly a0 l4-0 l3-0)
   deleted: (at a0 l4-0)
   added: (at a0 l3-0)
   goals met: 0 of 1
2. (fly a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 0 of 1
3. (fly a4 l2-0 l1-0)
   deleted: (at a4 l2-0)
   added: (at a4 l1-0)
   goals met: 0 of 1
4. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 0 of 1
5. (fly a6 l1-0 l4-0)
   deleted: (at a6 l1-0)
   added: (at a6 l4-0)
   goals met: 0 of 1
6. (load a1 p0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a1)
   goals met: 0 of 1
7. (fly a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 0 of 1
8. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 1
9. (fly a4 l1-0 l0-0)
   deleted: (at a4 l1-0)
   added: (at a4 l0-0)
   goals met: 0 of 1
10. (fly a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 0 of 1
11. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 1
12. (fly a3 l0-0 l4-0)
   deleted: (at a3 l0-0)
   added: (at a3 l4-0)
   goals met: 0 of 1
13. (fly a4 l0-0 l3-0)
   deleted: (at a4 l0-0)
   added: (at a4 l3-0)
   goals met: 0 of 1
14. (fly a5 l0-0 l2-0)
   deleted: (at a5 l0-0)
   added: (at a5 l2-0)
   goals met: 0 of 1
15. (fly a0 l3-0 l1-0)
   deleted: (at a0 l3-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
16. (fly a1 l2-0 l4-0)
   deleted: (at a1 l2-0)
   added: (at a1 l4-0)
   goals met: 0 of 1
17. (fly a3 l4-0 l0-0)
   deleted: (at a3 l4-0)
   added: (at a3 l0-0)
   goals met: 0 of 1
18. (fly a4 l3-0 l0-0)
   deleted: (at a4 l3-0)
   added: (at a4 l0-0)
   goals met: 0 of 1
19. (fly a5 l2-0 l0-0)
   deleted: (at a5 l2-0)
   added: (at a5 l0-0)
   goals met: 0 of 1
20. (fly a6 l4-0 l1-0)
   deleted: (at a6 l4-0)
   added: (at a6 l1-0)
   goals met: 0 of 1
21. (fly a0 l1-0 l3-0)
   deleted: (at a0 l1-0)
   added: (at a0 l3-0)
   goals met: 0 of 1
22. (fly a2 l1-0 l2-0)
   deleted: (at a2 l1-0)
   added: (at a2 l2-0)
   goals met: 0 of 1
23. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 1
24. (fly a4 l0-0 l4-0)
   deleted: (at a4 l0-0)
   added: (at a4 l4-0)
   goals met: 0 of 1
25. (fly a5 l0-0 l3-0)
   deleted: (at a5 l0-0)
   added: (at a5 l3-0)
   goals met: 0 of 1
26. (fly a6 l1-0 l0-0)
   deleted: (at a6 l1-0)
   added: (at a6 l0-0)
   goals met: 0 of 1
27. (unload a1 p0 l4-0)
   deleted: (in p0 a1)
   added: (at p0 l4-0)
   goals met: 1 of 1
